crazyhuaer/geeknimo/VC/touchpad/stm32_usb_hid/stm32_usb_hidDlg.cpp
// stm32_usb_hidDlg.cpp : implementation file
//


#include "stdafx.h"
#include "stm32_usb_hid.h"
#include "stm32_usb_hidDlg.h"
#include <dbt.h>

#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif

/////////////////////////////////////////////////////////////////////////////
// CStm32_usb_hidDlg dialog

CStm32_usb_hidDlg::CStm32_usb_hidDlg(CWnd* pParent /*=NULL*/)
	: CDialog(CStm32_usb_hidDlg::IDD, pParent)
{
	//{{AFX_DATA_INIT(CStm32_usb_hidDlg)
	//}}AFX_DATA_INIT
	MyDeviceDetected = FALSE;
// 	VendorID = 0x093a;
// 	ProductID = 0x2510;

	VendorID = 0x808;
	ProductID = 0x1010;

	//ReportType = 1;
	
	// Note that LoadIcon does not require a subsequent DestroyIcon in Win32
	m_hIcon = AfxGetApp()->LoadIcon(IDR_MAINFRAME);
}

void CStm32_usb_hidDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	//{{AFX_DATA_MAP(CStm32_usb_hidDlg)
	DDX_Control(pDX, IDC_EDIT_VID, m_CEditVid);
	DDX_Control(pDX, IDC_EDIT_PID, m_CEditPid);
	DDX_Control(pDX, IDC_RICHEDIT_OUTPUT_MESSAGE, m_CRichOutputMessage);
	//}}AFX_DATA_MAP
}

BEGIN_MESSAGE_MAP(CStm32_usb_hidDlg, CDialog)
	//{{AFX_MSG_MAP(CStm32_usb_hidDlg)
	ON_WM_PAINT()
	ON_WM_QUERYDRAGICON()
	ON_BN_CLICKED(IDC_BUTTON_DETECT, OnButtonDetect)
	ON_EN_CHANGE(IDC_EDIT_VID, OnChangeEditVid)
	ON_EN_CHANGE(IDC_EDIT_PID, OnChangeEditPid)
	ON_BN_CLICKED(IDC_BUTTON_READREPORT, OnButtonReadreport)
	ON_BN_CLICKED(IDC_BUTTON_WRITEREPORT, OnButtonWritereport)
	ON_BN_CLICKED(IDC_BUTTON_CLEAR, OnButtonClear)
	//}}AFX_MSG_MAP
END_MESSAGE_MAP()

/////////////////////////////////////////////////////////////////////////////
// CStm32_usb_hidDlg message handlers

BOOL CStm32_usb_hidDlg::OnInitDialog()
{
	CDialog::OnInitDialog();

	// Set the icon for this dialog.  The framework does this automatically
	//  when the application's main window is not a dialog
	SetIcon(m_hIcon, TRUE);			// Set big icon
	SetIcon(m_hIcon, FALSE);		// Set small icon
	
	// TODO: Add extra initialization here
	m_CRichOutputMessage.SetReadOnly(TRUE);
	//m_CRichOutputMessage.EnableWindow(FALSE);
	//m_CEditVid.SetWindowText("8080");
	//m_CEditPid.SetWindowText("0101");
	m_CEditVid.SetWindowText("093a");
	m_CEditPid.SetWindowText("2510");
	return TRUE;  // return TRUE  unless you set the focus to a control
}

// If you add a minimize button to your dialog, you will need the code below
//  to draw the icon.  For MFC applications using the document/view model,
//  this is automatically done for you by the framework.

void CStm32_usb_hidDlg::OnPaint() 
{
	if (IsIconic())
	{
		CPaintDC dc(this); // device context for painting

		SendMessage(WM_ICONERASEBKGND, (WPARAM) dc.GetSafeHdc(), 0);

		// Center icon in client rectangle
		int cxIcon = GetSystemMetrics(SM_CXICON);
		int cyIcon = GetSystemMetrics(SM_CYICON);
		CRect rect;
		GetClientRect(&rect);
		int x = (rect.Width() - cxIcon + 1) / 2;
		int y = (rect.Height() - cyIcon + 1) / 2;

		// Draw the icon
		dc.DrawIcon(x, y, m_hIcon);
	}
	else
	{
		CDialog::OnPaint();
	}
}

// The system calls this to obtain the cursor to display while the user drags
//  the minimized window.
HCURSOR CStm32_usb_hidDlg::OnQueryDragIcon()
{
	return (HCURSOR) m_hIcon;
}

void CStm32_usb_hidDlg::OnButtonDetect() 
{
	FindTheDevice();
}


void CStm32_usb_hidDlg::RegisterForDeviceNotifications()
{
	// Request to receive messages when a device is attached or removed.
	// Also see WM_DEVICECHANGE in BEGIN_MESSAGE_MAP(CUsbhidiocDlg, CDialog).
	
	DEV_BROADCAST_DEVICEINTERFACE DevBroadcastDeviceInterface;
	HDEVNOTIFY DeviceNotificationHandle;
	
	DevBroadcastDeviceInterface.dbcc_size = sizeof(DevBroadcastDeviceInterface);
	DevBroadcastDeviceInterface.dbcc_devicetype = DBT_DEVTYP_DEVICEINTERFACE;
	DevBroadcastDeviceInterface.dbcc_classguid = HidGuid;
	
	DeviceNotificationHandle =
	RegisterDeviceNotification(m_hWnd, &DevBroadcastDeviceInterface, DEVICE_NOTIFY_WINDOW_HANDLE);
}

void CStm32_usb_hidDlg::DisplayLastError(CString Operation)
{
	//Display a message and the last error in the log List Box.
	
	LPVOID lpMsgBuf;
	USHORT Index = 0;
	CString	strLastError = "";
	FormatMessage( 
		FORMAT_MESSAGE_ALLOCATE_BUFFER | 
		FORMAT_MESSAGE_FROM_SYSTEM | 
		FORMAT_MESSAGE_IGNORE_INSERTS,
		NULL,
		GetLastError(),
		MAKELANGID(LANG_NEUTRAL, SUBLANG_DEFAULT),
		(LPTSTR) &lpMsgBuf,
		0,
		NULL 
		);
	
	//Display the last error.
	
	strLastError = Operation + (LPCTSTR)lpMsgBuf; 
	
	//Trim CR/LF from the error message.
	
	strLastError.TrimRight(); 
	
// 	Index = m_ResultsList.InsertString(-1, strLastError);
// 	ScrollToBottomOfListBox(Index);
// 	LocalFree(lpMsgBuf); 
}

void CStm32_usb_hidDlg::GetDeviceCapabilities()
{
	//Get the Capabilities structure for the device.
	
	PHIDP_PREPARSED_DATA	PreparsedData;
	
	/*
	API function: HidD_GetPreparsedData
	Returns: a pointer to a buffer containing the information about the device's capabilities.
	Requires: A handle returned by CreateFile.
	There's no need to access the buffer directly,
	but HidP_GetCaps and other API functions require a pointer to the buffer.
	*/
	
	HidD_GetPreparsedData 
		(DeviceHandle, 
		&PreparsedData);
	DisplayLastError("HidD_GetPreparsedData: ");
	
	/*
	API function: HidP_GetCaps
	Learn the device's capabilities.
	For standard devices such as joysticks, you can find out the specific
	capabilities of the device.
	For a custom device, the software will probably know what the device is capable of,
	and the call only verifies the information.
	Requires: the pointer to the buffer returned by HidD_GetPreparsedData.
	Returns: a Capabilities structure containing the information.
	*/
	
	HidP_GetCaps 
		(PreparsedData, 
		&Capabilities);
	DisplayLastError("HidP_GetCaps: ");
	
	//Display the capabilities
	
	ValueToDisplay.Format("%s%X", "Usage Page: ", Capabilities.UsagePage);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Input Report Byte Length: ", Capabilities.InputReportByteLength);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Output Report Byte Length: ", Capabilities.OutputReportByteLength);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Feature Report Byte Length: ", Capabilities.FeatureReportByteLength);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of Link Collection Nodes: ", Capabilities.NumberLinkCollectionNodes);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of Input Button Caps: ", Capabilities.NumberInputButtonCaps);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of InputValue Caps: ", Capabilities.NumberInputValueCaps);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of InputData Indices: ", Capabilities.NumberInputDataIndices);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of Output Button Caps: ", Capabilities.NumberOutputButtonCaps);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of Output Value Caps: ", Capabilities.NumberOutputValueCaps);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of Output Data Indices: ", Capabilities.NumberOutputDataIndices);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of Feature Button Caps: ", Capabilities.NumberFeatureButtonCaps);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of Feature Value Caps: ", Capabilities.NumberFeatureValueCaps);
	DisplayData(ValueToDisplay);
	ValueToDisplay.Format("%s%d", "Number of Feature Data Indices: ", Capabilities.NumberFeatureDataIndices);
	DisplayData(ValueToDisplay);
	
	//No need for PreparsedData any more, so free the memory it's using.
	
	HidD_FreePreparsedData(PreparsedData);
	DisplayLastError("HidD_FreePreparsedData: ") ;
}

void CStm32_usb_hidDlg::PrepareForOverlappedTransfer()
{
	//Get a handle to the device for the overlapped ReadFiles.
	
	ReadHandle=CreateFile 
		(detailData->DevicePath, 
		GENERIC_READ, 
		FILE_SHARE_READ|FILE_SHARE_WRITE,
		(LPSECURITY_ATTRIBUTES)NULL, 
		OPEN_EXISTING, 
		FILE_FLAG_OVERLAPPED, 
		NULL);
	
	DisplayLastError("CreateFile (ReadHandle): ");
	
	//Get an event object for the overlapped structure.
	
