crazyhuaer/geeknimo/VC/touchpad/stm32_usb_hid/stm32_usb_hidDlg.cpp
			if (Attributes.VendorID == VendorID)
			{
				if (Attributes.ProductID == ProductID)
				{
					//Both the Vendor ID and Product ID match.

					MyDeviceDetected = TRUE;
					MyDevicePathName = detailData->DevicePath;
					////DisplayData("Device detected");

					//Register to receive device notifications.

					RegisterForDeviceNotifications();

					//Get the device's capablities.

					GetDeviceCapabilities();

					// Find out if the device is a system mouse or keyboard.
					
					DeviceUsage = (Capabilities.UsagePage * 256) + Capabilities.Usage;

					if (DeviceUsage == 0x102)
					{
						UsageDescription = "mouse";
					}
				
					if (DeviceUsage == 0x106)
					{
						UsageDescription = "keyboard";
					}

					if ((DeviceUsage == 0x102) | (DeviceUsage == 0x106)) 
					{
						DisplayData("");
						DisplayData("*************************");
						DisplayData("The device is " + UsageDescription + ".");
						DisplayData("*************************");
						DisplayData("");
					}

					// Get a handle for writing Output reports.

					WriteHandle=CreateFile 
						(detailData->DevicePath, 
						GENERIC_WRITE, 
						FILE_SHARE_READ|FILE_SHARE_WRITE, 
						(LPSECURITY_ATTRIBUTES)NULL,
						OPEN_EXISTING, 
						0, 
						NULL);

					DisplayLastError("CreateFile: ");

					// Prepare to read reports using Overlapped I/O.

					PrepareForOverlappedTransfer();

				} //if (Attributes.ProductID == ProductID)

				else
					//The Product ID doesn't match.

					CloseHandle(DeviceHandle);

			} //if (Attributes.VendorID == VendorID)

			else
			{
				//The Vendor ID doesn't match.
				CString temp;
				temp.Format("  VendorID:0x%04x,ProductID:0x%04x  ",VendorID,ProductID);
				DisplayData("没有找到"+temp+"的设备");
				CloseHandle(DeviceHandle);
			}
			//Free the memory used by the detailData structure (no longer needed).

			free(detailData);

		}  //if (Result != 0)

		else
			//SetupDiEnumDeviceInterfaces returned 0, so there are no more devices to check.

			LastDevice=TRUE;

		//If we haven't found the device yet, and haven't tried every available device,
		//try the next one.

		MemberIndex = MemberIndex + 1;

	} //do

	while ((LastDevice == FALSE) && (MyDeviceDetected == FALSE));

	// display the data
	
	//Free the memory reserved for hDevInfo by SetupDiClassDevs.
	
	SetupDiDestroyDeviceInfoList(hDevInfo);
	DisplayLastError("SetupDiDestroyDeviceInfoList");
	return MyDeviceDetected;
}

void CStm32_usb_hidDlg::ReadAndWriteToDevice(bool ReportType)
{
	//If necessary, find the device and learn its capabilities.
	//Then send a report and request a report.
	
	//Clear the List Box (optional).
	//m_ResultsList.ResetContent();
	
	DisplayData("***HID Test Report***");
	DisplayCurrentTime();
	
	//If the device hasn't been detected already, look for it.
	
	if (MyDeviceDetected==FALSE)
	{
		MyDeviceDetected=FindTheDevice(); 
	}
	
	// Do nothing if the device isn't detected.
	
	if (MyDeviceDetected==TRUE)
	{
		switch (ReportType)
		{
			case 0:
			{
				// Output and Input Reports
				
				//Write a report to the device.
				
				//WriteOutputReport();
				
				//Read a report from the device.
				
				ReadInputReport();	
				
				break;
			}
			case 1:
			{
				// Feature reports
				
				//Write a report to the device.
				
				//WriteFeatureReport();
				
				//Read a report from the device.
				
				ReadFeatureReport();
				
				break;
			}
				
// 			default:
// 			{
// 				break;
// 			}
		} // switch
	} // else
}

void CStm32_usb_hidDlg::ReadInputReport()
{
	// Retrieve an Input report from the device.

	CString	ByteToDisplay = "";

	DWORD	Result;
	
	//The first byte is the report number.
	InputReport[0]=0;

	// Find out if the "Use Control Transfers Only" check box is checked.

	UpdateData(true);

	// template add 
	bool m_UseControlTransfersOnly = true;

	if (m_UseControlTransfersOnly) 
	{

		//Read a report from the device using a control transfer.
	
		/*
		HidD_GetInputReport
		Returns:
		True on success
		Requires: 
		A device handle returned by CreateFile.
		A buffer to hold the report.
		The report length returned by HidP_GetCaps in Capabilities.InputReportByteLength.
		*/
		
		if (ReadHandle != INVALID_HANDLE_VALUE)
		{
			Result = HidD_GetInputReport
			(ReadHandle,
			InputReport,
			Capabilities.InputReportByteLength);

			DisplayLastError("HidD_GetInputReport: ");
		}
		else
		{
			Result = FALSE;
		}

		if (!Result)
		{
			//The read attempt failed, so close the handles, display a message,
			//and set MyDeviceDetected to FALSE so the next attempt will look for the device.

			CloseHandles();
			DisplayData("Can't read from device");
			MyDeviceDetected = FALSE;
		}
		else
		{
			DisplayData("Received Input report: ");
			
			//Display the report data.

			DisplayInputReport();
		
			/*
			USHORT	ByteNumber;
			CHAR	ReceivedByte;
		
			//Display the received data in the log and the Bytes Received List boxes.
			//Start at the top of the List Box.

			m_BytesReceived.ResetContent();
	
			//Step through the received bytes and display each.

			for (ByteNumber=0; ByteNumber < Capabilities.InputReportByteLength; ByteNumber++)
			{
				//Get a byte.

				ReceivedByte = InputReport[ByteNumber];

				//Display it.

				DisplayReceivedData(ReceivedByte);
			}
			*/
		}	// if result
	} 
	else
	{
 	
		/*API call:ReadFile
		'Returns: the report in InputReport.
		'Requires: a device handle returned by CreateFile
		'(for overlapped I/O, CreateFile must be called with FILE_FLAG_OVERLAPPED),
		'the Input report length in bytes returned by HidP_GetCaps,
		'and an overlapped structure whose hEvent member is set to an event object.
		*/

		if (ReadHandle != INVALID_HANDLE_VALUE)
		{
			Result = ReadFile 
			(ReadHandle, 
			InputReport, 
			Capabilities.InputReportByteLength, 
			&NumberOfBytesRead,
			(LPOVERLAPPED) &HIDOverlapped); 
		}
 
		DisplayLastError("ReadFile: ") ;

		/*API call:WaitForSingleObject
		'Used with overlapped ReadFile.
		'Returns when ReadFile has received the requested amount of data or on timeout.
		'Requires an event object created with CreateEvent
		'and a timeout value in milliseconds.
		*/

