crazyhuaer/geeknimo/VC/touchpad/stm32_usb_hid/stm32_usb_hidDlg.cpp
		Result = WaitForSingleObject 
			(hEventObject, 
			6000);

		DisplayLastError("WaitForSingleObject: ") ;
 
		switch (Result)
		{
			case WAIT_OBJECT_0:
			{
				DisplayData("Received Input report,");
							
				break;
			}
			case WAIT_TIMEOUT:
			{
				ValueToDisplay.Format("%s", "ReadFile timeout");
				DisplayData(ValueToDisplay);
				//Cancel the Read operation.

				/*API call: CancelIo
				Cancels the ReadFile
				Requires the device handle.
				Returns non-zero on success.
				*/
				
				Result = CancelIo(ReadHandle);
				
				//A timeout may mean that the device has been removed. 
				//Close the device handles and set MyDeviceDetected = False 
				//so the next access attempt will search for the device.
				CloseHandles();
				DisplayData("Can't read from device");
				MyDeviceDetected = FALSE;
				break;
			}
			default:
			{
				ValueToDisplay.Format("%s", "Undefined error");

				//Close the device handles and set MyDeviceDetected = False 
				//so the next access attempt will search for the device.

				CloseHandles();
				DisplayData("Can't read from device");
				MyDeviceDetected = FALSE;
				break;
			}
		}

		/*
		API call: ResetEvent
		Sets the event object to non-signaled.
		Requires a handle to the event object.
		Returns non-zero on success.
		*/

		ResetEvent(hEventObject);

		//Display the report data.

		DisplayInputReport();

	}
}

void CStm32_usb_hidDlg::WriteOutputReport()
{
	//Send a report to the device.

	DWORD	BytesWritten = 0;
	INT		Index =0;
	ULONG	Result;
	CString	strBytesWritten = "";

	UpdateData(true);

	//The first byte is the report number.

	OutputReport[0]=0;

	//Can set the other report values here, or get them from the combo boxes.
	//OutputReport[1]=33;
	//OutputReport[2]=6;

	//Get the bytes to send from the combo boxes.
	
	//If Autoincrement is checked, increment the selection.

// 	if (m_cbutAutoIncrement.GetCheck()>0)
// 		{
// 		Index=m_cboByteToSend0.GetCurSel();
// 		Index=Index+1;
// 		if(Index > 0xff) 
// 			Index = 0;
// 		m_cboByteToSend0.SetCurSel(Index);
// 		}
// 
// 	if (m_cbutAutoIncrement.GetCheck()>0)
// 		{
// 		Index=m_cboByteToSend1.GetCurSel();
// 		Index=Index+1;
// 		if(Index > 255)
// 			Index = 0;
// 		m_cboByteToSend1.SetCurSel(Index);
// 		}	
// 
// 	//Get the values from the combo boxes.
// 
// 	OutputReport[1]=m_cboByteToSend0.GetCurSel();
// 	OutputReport[2]=m_cboByteToSend1.GetCurSel();


	//The first byte is the report number.

	OutputReport[0]=0;

	// template add
	bool m_UseControlTransfersOnly = false;

	if (m_UseControlTransfersOnly)
	{

		//Send a report to the device.

		/*
		HidD_SetOutputReport
		Sends a report to the device.
		Returns: success or failure.
		Requires:
		The device handle returned by CreateFile.
		A buffer that holds the report.
		The Output Report length returned by HidP_GetCaps,
		*/

		if (WriteHandle != INVALID_HANDLE_VALUE)
		{
			Result = HidD_SetOutputReport
			(WriteHandle,
			OutputReport,
			Capabilities.OutputReportByteLength);

			DisplayLastError("HidD_SetOutputReport: ");
		}

		if (Result)
		{
			DisplayData("An Output report was written to the device.");
		}
		else
		{
			//The write attempt failed, so close the handles, display a message,
			//and set MyDeviceDetected to FALSE so the next attempt will look for the device.

			CloseHandles();
			DisplayData("Can't write to device");
			MyDeviceDetected = FALSE;
		}

	}
	else
	{

		/*
		API Function: WriteFile
		Sends a report to the device.
		Returns: success or failure.
		Requires:
		A device handle returned by CreateFile.
		A buffer that holds the report.
		The Output Report length returned by HidP_GetCaps,
		A variable to hold the number of bytes written.
		*/

		if (WriteHandle != INVALID_HANDLE_VALUE)
		{
			Result = WriteFile 
			(WriteHandle, 
			OutputReport, 
			Capabilities.OutputReportByteLength, 
			&BytesWritten, 
			NULL);
		}

		//Display the result of the API call and the report bytes.

		DisplayLastError("WriteFile: ");

		if (!Result)
		{
			//The WriteFile failed, so close the handles, display a message,
			//and set MyDeviceDetected to FALSE so the next attempt will look for the device.

			CloseHandles();
			DisplayData("Can't write to device");
			MyDeviceDetected = FALSE;
		}
		else
		{
			DisplayData("An Output report was written to the device.");
			strBytesWritten.Format("%s%d", "Bytes Written: ", BytesWritten); 
			DisplayData(strBytesWritten);
		}
	}
}


void CStm32_usb_hidDlg::WriteFeatureReport()
{
	//Send a report to the device.
	
	DWORD	BytesWritten = 0;
	INT		Index =0;
	ULONG	Result;
	CString	strBytesWritten = "";
	
	//The first byte is the report number.
	
	FeatureReport[0]=0;
	
	//Can set the other report values here, or get them from the combo boxes.
	//OutputReport[1]=33;
	//OutputReport[2]=6;
	
	//Get the bytes to send from the combo boxes.
	
	//If Autoincrement is checked, increment the selection.
	
// 	if (m_cbutAutoIncrement.GetCheck()>0)
// 	{
// 		Index=m_cboByteToSend0.GetCurSel();
// 		Index=Index+1;
// 		m_cboByteToSend0.SetCurSel(Index);
// 	}
// 	
// 	if (m_cbutAutoIncrement.GetCheck()>0)
// 	{
// 		Index=m_cboByteToSend1.GetCurSel();
// 		Index=Index+1;
// 		m_cboByteToSend1.SetCurSel(Index);
// 	}
	
	//Get the values from the combo boxes.
	
// 	FeatureReport[1]=m_cboByteToSend0.GetCurSel();
// 	FeatureReport[2]=m_cboByteToSend1.GetCurSel();
	
	
	//The first byte is the report number.
	
	FeatureReport[0]=0;
	
	//Send a report to the device.
	
	/*
	HidD_SetFeature
	Sends a report to the device.
	Returns: success or failure.
	Requires:
	A device handle returned by CreateFile.
	A buffer that holds the report.
	The Output Report length returned by HidP_GetCaps,
	*/
	
	if (DeviceHandle != INVALID_HANDLE_VALUE)
	{
		Result = HidD_SetFeature
			(DeviceHandle,
			FeatureReport,
			Capabilities.FeatureReportByteLength);
	}
	
	DisplayLastError("HidD_SetFeature: ");
	
	if (!Result)
	{
		//The write attempt failed, so close the handles, display a message,
		//and set MyDeviceDetected to FALSE so the next attempt will look for the device.
		
		CloseHandles();
		DisplayData("Can't write to device");
		MyDeviceDetected = FALSE;
	}
	else
	{
		DisplayData("A Feature report was written to the device.");
	}
}

void CStm32_usb_hidDlg::ReadFeatureReport()
{
	// Read a Feature report from the device.
	
	CString	ByteToDisplay = "";
	BOOLEAN	Result;
	
	//The first byte is the report number.
	FeatureReport[0]=0;
	
	//Read a report from the device.
	
