crazyhuaer/geeknimo/VC/touchpad/stm32_usb_hid/stm32_usb_hidDlg.cpp
	/*
	HidD_GetFeature
	Returns:
	True on success
	Requires: 
	A device handle returned by CreateFile.
	A buffer to hold the report.
	The report length returned by HidP_GetCaps in Capabilities.InputReportByteLength.
	*/
	
	if (DeviceHandle != INVALID_HANDLE_VALUE)
	{
		Result = HidD_GetFeature
			(DeviceHandle,
			FeatureReport,
			Capabilities.FeatureReportByteLength);
		
		DisplayLastError("HidD_GetFeature: ");
	}
				
	if (!Result)
	{
		//The read attempt failed, so close the handles, display a message,
		//and set MyDeviceDetected to FALSE so the next attempt will look for the device.
		
		CloseHandles();
		DisplayData("Can't read from device");
		MyDeviceDetected = FALSE;
	}
	else
	{
		DisplayData("Received Feature report: ");
		
		DisplayFeatureReport();
	}
}

void CStm32_usb_hidDlg::DisplayInputReport()
{
	USHORT	ByteNumber;
	CHAR	ReceivedByte;
	
	//Display the received data in the log and the Bytes Received List boxes.
	//Start at the top of the List Box.
	
//	m_BytesReceived.ResetContent();
	
	//Step through the received bytes and display each.
	
	for (ByteNumber=0; ByteNumber < Capabilities.InputReportByteLength; ByteNumber++)
	{
		//Get a byte.
		
		ReceivedByte = InputReport[ByteNumber];
		
		//Display it.
		
//		DisplayReceivedData(ReceivedByte);
	}
}

void CStm32_usb_hidDlg::CloseHandles()
{
	//Close open handles.
	
	if (DeviceHandle != INVALID_HANDLE_VALUE)
	{
		CloseHandle(DeviceHandle);
	}
	
	if (ReadHandle != INVALID_HANDLE_VALUE)
	{
		CloseHandle(ReadHandle);
	}
	
	if (WriteHandle != INVALID_HANDLE_VALUE)
	{
		CloseHandle(WriteHandle);
	}
}

void CStm32_usb_hidDlg::DisplayFeatureReport()
{
	USHORT	ByteNumber;
	CHAR	ReceivedByte;
	
	//Display the received data in the log and the Bytes Received List boxes.
	//Start at the top of the List Box.
	
// 	m_BytesReceived.ResetContent();
	
	//Step through the received bytes and display each.
	
	for (ByteNumber=0; ByteNumber < Capabilities.FeatureReportByteLength; ByteNumber++)
	{
		//Get a byte.
		
		ReceivedByte = FeatureReport[ByteNumber];
		
		//Display it.
		
// 		DisplayReceivedData(ReceivedByte);
	}
}

void CStm32_usb_hidDlg::OnButtonReadreport() 
{
	// TODO: Add your control notification handler code here
	CStm32_usb_hidDlg::ReadAndWriteToDevice(0);
	m_CRichOutputMessage.PostMessage(WM_VSCROLL, SB_BOTTOM,0);
}

void CStm32_usb_hidDlg::OnButtonWritereport() 
{
	// TODO: Add your control notification handler code here
	CStm32_usb_hidDlg::ReadAndWriteToDevice(1);
	m_CRichOutputMessage.PostMessage(WM_VSCROLL, SB_BOTTOM,0);
}

void CStm32_usb_hidDlg::OnButtonClear() 
{
	// TODO: Add your control notification handler code here
	m_CRichOutputMessage.SetWindowText("");
}
